@echo off
:: Устанавливаем кодировку UTF-8 для корректного отображения русских символов
chcp 65001 > nul
title Stop servers
echo        ========================================
echo                  Остановка серверов
echo        ========================================

:: 1. Останавливаем сервер Nginx
echo.
echo        Остановка сервера Nginx...
timeout /t 1 /nobreak > nul

cd /d "C:\nginx-1.28.0"
:: Добавлено 2>nul, чтобы скрыть ошибку "файл не найден" если используем dev-сервер.
.\nginx.exe -s stop 2>nul
::.\nginx.exe -s stop

:: Выводим информационное сообщение
echo        Nginx остановлен!
timeout /t 1 /nobreak > nul
:: ---------------------------------------------------------------------------------------------

:: 2. Принудительно останавливаем сервер Django (runserver или Waitress)
echo.
echo        Остановка сервера Django...
timeout /t 1 /nobreak > nul
:: Находим окно с заголовком "Django" и принудительно завершаем его (/F)
:: Перенаправляем вывод > nul, чтобы скрыть сообщение об успешном завершении
taskkill /FI "WINDOWTITLE eq Django" /T /F > nul
echo        Django остановлен!
:: ---------------------------------------------------------------------------------------------

echo.
timeout /t 2 /nobreak > nul
echo        ========================================
echo                Все серверы остановлены!
echo        ========================================
echo.
echo        Это окно закроется автоматически...
timeout /t 3 /nobreak > nul
:: Закрываем окно
exit
:: ---------------------------------------------------------------------------------------------