import pandas as pd
from datetime import datetime, date
import matplotlib.pyplot as plt
import warnings
import reference_files.reference_data as rd

# Команда для удаления предупреждений Pandas в консоли
warnings.simplefilter(action="ignore", category=Warning)

# -------------------------------------- Входные изменяемые данные ------------------------------
year = 2025  # год по которому делаем анализ

# номер месяца по которому делаем отчет
num_month = 5  # ... июль = 7 и т.д.

# --------------------------------------- Подготовка датафрейма ---------------------------------
now = datetime.now()  # получаем текущую дату
year_now = now.year  # сохраняем текущий год

# считываем данные из файла Excel и создаем фрейм
df = pd.read_excel(
    f"//Server/otk/2 ИННА/Списание БРАКА по ЦЕХАМ/ЖУРНАЛ УЧЕТА актов о браке_2020-{year_now}.xlsx",
    sheet_name=str(year),
    usecols=[
        "Дата_регистрации_акта_НП",
        "Наименование_детали",
        "Обозначение_детали",
        "Количество",
        "Сумма_по_акту",
        "ПРИЧИНА",
        "ВИНОВНИК",
        "Цех_участок",
        "Операция",
        "Описание_дефектов_и_причин",
        "Основание_для_списания (КТУ, акт, протокол и др.)",
    ],
    header=1,
)

# удаляем пустые строки в столбце "Дата_регистрации_акта_НП" и "Сумма_по_акту"
df.dropna(subset=["Дата_регистрации_акта_НП", "Сумма_по_акту"], inplace=True)

# изменяем тип данных в столбце "Дата_регистрации_акта_НП" на datetime
df["Дата_регистрации_акта_НП"] = pd.to_datetime(df["Дата_регистрации_акта_НП"], errors="coerce")
# print(df.info())

# изменяем тип данных в столбцах 'Количество', 'ПРИЧИНА', 'ВИНОВНИК' на целочисленный
df[["Количество", "ПРИЧИНА", "ВИНОВНИК"]] = df[["Количество", "ПРИЧИНА", "ВИНОВНИК"]].astype("int16")


# ---------------------------- Выборка из датафрейма по номеру месяца ----------------------------
# вспомогательный словарь номера и наименования месяца года
dct = {
    1: "январь",
    2: "февраль",
    3: "март",
    4: "апрель",
    5: "май",
    6: "июнь",
    7: "июль",
    8: "август",
    9: "сентябрь",
    10: "октябрь",
    11: "ноябрь",
    12: "декабрь",
}

# Фильтруем датафрейм по номеру месяца
dfn = df[df["Дата_регистрации_акта_НП"].dt.month == num_month]


# ------------------------------------- Датафрейм ТНО --------------------------------------------
# Формируем датафрейм ТНО
dfn_tno = dfn[dfn["ПРИЧИНА"].isin([8, 23, 24])]

# Заменяем в датафрейме шифр ПРИЧИНЫ на текст по словарю из вспомогательного файла
dfn_tno["ПРИЧИНА"] = dfn_tno["ПРИЧИНА"].map(rd.dct_pric)

# Группируем по столбцам "Наименование_детали", 'Обозначение_детали', "ПРИЧИНА"
# и считаем сумму по столбцу "Количество" и "Сумма_по_акту"
df_tno_group = (
    dfn_tno.groupby(["Наименование_детали", "Обозначение_детали", "ПРИЧИНА"])
    .agg({"Количество": sum, "Сумма_по_акту": sum})
    .astype({"Количество": "int"})
).sort_values("Сумма_по_акту", ascending=False)

# Расчитываем сумму значений в столбце 'Сумма_по_акту'
sum_col = df_tno_group["Сумма_по_акту"].sum()

# Добавляем в конец новые строки с черточками для визуализации
# и с суммой с учетом мультииндекса ["Наименование_детали", 'Обозначение_детали', "ПРИЧИНА"]
df_tno_group.loc[(f"{'-'*16}", "", "")] = ["", f"{'-'*10}"]
df_tno_group.loc[("ИТОГО", "", "")] = ["", sum_col]

# сохраняем в файл .txt
with open(
    f"ОТЧЕТЫ/4. Отчет за {dct[num_month]} 2025 года - ТНО.txt", "w", encoding="utf-8"
) as file:
    print(f"\tОтчет за {dct[num_month]} 2025 года - ТНО", file=file)
    file.write(df_tno_group.to_string())

print("\nОтчет по ТНО записан.")


# ----------------------------------- Датафрейм не-ТНО --------------------------------------------
dfn_no_tno = dfn[~dfn["ПРИЧИНА"].isin([8, 23, 24])]
dfn_no_tno["ПРИЧИНА"] = dfn_no_tno["ПРИЧИНА"].map(rd.dct_pric)

df_no_tno_group = (
    dfn_no_tno.groupby(["Наименование_детали", "Обозначение_детали", "ПРИЧИНА"])
    .agg({"Количество": sum, "Сумма_по_акту": sum})
    .astype({"Количество": "int"})
).sort_values("Сумма_по_акту", ascending=False)

sum_col = df_no_tno_group["Сумма_по_акту"].sum()
df_no_tno_group.loc[(f"{'-'*16}", "", "")] = ["", f"{'-'*10}"]
df_no_tno_group.loc[("ИТОГО", "", "")] = ["", sum_col]

with open(
    f"ОТЧЕТЫ/4. Отчет за {dct[num_month]} 2025 года - не ТНО.txt", "w", encoding="utf-8"
) as file:
    print(f"\tОтчет за {dct[num_month]} 2025 года - не ТНО", file=file)
    file.write(df_no_tno_group.to_string())

print("\nОтчет по не-ТНО записан.\n")
# --------------------------------------------------------------------------------------------------
