import pandas as pd

file = "//Server/otk/ПРЕТЕНЗИИ/ЖУРНАЛ претензий_ЯМЗ.xlsx"

# читаем файл Excel и создаем датафрейм
df = pd.read_excel(file, sheet_name="ЯМЗ 2024", usecols=["Номер и дата акта исследования"], header=1)

# Из колонки "Номер и дата акта" создаем список, заменяя отсутствующие значения пустой строкой
lst = df["Номер и дата акта исследования"].fillna("").to_list()
# Убираем из списка пустые строки
lst = [s for s in lst if s]

# Проходим циклом по списку актов и если в ячейке указано несколько актов через "\n",
# то сплитуем по символу и дважды делаем замену символов, приводя к виду "nnn-dd-mm-yy".
# Если указан один акт, то сразу делаем замену символов.
acts = []
for s in lst:
    if "\n" in s:
        tmp_lst = s.split("\n")
        for s_tmp in tmp_lst:
            act = s_tmp.replace(" от ", "-").replace(".", "-")
            acts.append(act)
    else:
        act = s.replace(" от ", "-").replace(".", "-")
        acts.append(act)

# Список актов для проверки присутствия в Журнале
new_act = [
    '56-31-01-24', '110-08-02-24', '67-31-01-24', '28-19-01-24', '889-01-12-23', '64-31-01-24', 
    '65-31-01-24', '66-31-01-24', '111-08-02-24', '145-08-02-24', '75-31-01-24', '81-31-01-24', 
    '901-08-12-23', '902-08-12-23', '897-08-12-23', '896-08-12-23', '903-08-12-23', '288-01-04-24', 
    '945-19-12-23', '900-08-12-23', '899-08-12-23', '68-31-01-24', '898-08-12-23', '909-08-12-23', 
    '948-19-12-23', '82-31-01-24', '949-19-12-23', '950-19-12-23', '117-08-02-24', '83-31-01-24', 
    '118-08-02-24', '92-31-01-24', '91-31-01-24', '69-31-01-24', '89-31-01-24', '77-31-01-24', 
    '88-31-01-24', '70-31-01-24', '87-31-01-24', '86-31-01-24', '85-31-01-24', '71-31-01-24', 
    '84-31-01-24']

# Результат проверки: номер акта - True/False
for n_a in new_act:
    print(f"{n_a} - {n_a in acts}")

# Сортированный список номеров актов для использования в 4.2
num_act = sorted(int(act.split("-")[0]) for act in new_act)
print("Список актов:", num_act)
print("Всего актов:", len(num_act))

# Список номеров актов 2024 года
end_24 = sorted(int(act.split("-")[0]) for act in new_act if act.endswith('24'))
print("Акты 2024 года:", end_24)
# Список номеров актов 2023 года
end_23 = sorted(int(act.split("-")[0]) for act in new_act if act.endswith('23'))
print("Акты 2023 года:", end_23)

print(len(end_24) + len(end_23))