# Файл со справочными данными для импорта в исполняемые файлы

# Словарь ПРИЧИН списания брака
dct_pric = {
    1: "Несоответствие заготовок чертежам",
    2: "Небрежное отношение к работе",
    3: "Невыполнение требований техпроцесса",
    4: "ТД не соответствует КД",
    5: "Несовершенство конструкции приспособления",
    6: "Некачественная термическая обработка",
    7: "Несоответствие материала требованиям КД",
    8: "ТНО-Наладка оборудования",
    9: "Несвоевременная замена РИ и СИ",
    10: "Освоение новых видов продукции",
    11: "Невыполнение контрольной операции",
    12: "Непринятие мер по предписанию ОТК",
    13: "Неисправность оборудования",
    14: "Ошибка при приёмке продукции",
    15: "Нарушение хранения, складирования, упаковки",
    16: "Нарушение правил транспортировки",
    17: "Неисправность оснастки и инструмента",
    18: "Некачественная консервация",
    19: "Недостатки в организации производства",
    20: "Дефекты комплектующих изделий",
    21: "Дефекты деталей, возникшие в гарантийный период",
    22: "Дефекты деталей поступивших в капитальный ремонт",
    23: "ТНО-Обучение учеников",
    24: "ТНО-Разрушающий контроль",
}

# Словарь ВИНОВНИКОВ дефектов
dct_vin = {
    1: "Наладчик",
    2: "Оператор",
    3: "Служба механика цеха",
    4: "Служба энергетика цеха",
    5: "ИНЦ №4",
    6: "ИНО",
    7: "ОГК",
    8: "ОГТ",
    9: "ОГЭ",
    10: "ОГМ",
    11: "ОКС",
    12: "Внешние поставщики",
    13: "ТНО",
}
