# Файл со справочными данными для импорта в исполняемые файлы

# Словарь ПРИЧИН списания брака
dct_pric = {
    1: "Несоответствие заготовок требованиям чертежа",
    2: "Небрежное отношение к работе",
    3: "Невыполнение требований техпроцесса",
    4: "ТД не соответствует КД",
    5: "Несовершенство конструкции приспособления",
    6: "Некачественная термическая обработка",
    7: "Несоответствие материала требованиям КД",
    8: "ТНО - Наладка оборудования, оснастки, испытания",
    9: "Несвоевременная замена РИ и СИ",
    10: "Освоение новых видов продукции",
    11: "Невыполнение контрольной операции",
    12: "Непринятие мер по предписанию ОТК",
    13: "Неисправность оборудования",
    14: "Ошибка при приёмке продукции",
    15: "Нарушение хранения, складирования, упаковки",
    16: "Нарушение правил транспортировки",
    17: "Неисправность оснастки, приспособлений, инструмента",
    18: "Некачественная консервация",
    19: "Недостатки в организации производства",
    20: "Дефекты комплектующих изделий",
    21: "Дефекты деталей, возникшие в гарантийный период",
    22: "Дефекты деталей, узлов, поступивших в капитальный ремонт",
    23: "ТНО - Потери при обучении ученика",
    24: "ТНО - Разрушающий контроль",
}

# Словарь ВИНОВНИКОВ дефектов
dct_vin = {
    1: "Наладчик",
    2: "Оператор",
    3: "Служба механика цеха",
    4: "Служба энергетика цеха",
    5: "Инструментальный цех",
    6: "Инструментальный отдел",
    7: "Отдел главного конструктора",
    8: "Отдел главного технолога",
    9: "Отдел главного энергетика",
    10: "Отдел главного механика",
    11: "Отдел капитального строительства",
    12: "Внешние поставщики",
    13: "ТНО",
}
